[
  {
    "path": "posts/2022-11-16-disseminating-free-web-apps-for-slps-at-asha2022/",
    "title": "#ASHA2022: New tools for SLPs working with individuals with aphasia",
    "description": {},
    "author": [
      {
        "name": "Rob Cavanaugh",
        "url": {}
      }
    ],
    "date": "2022-11-16",
    "categories": [],
    "contents": "\nI haven’t attended ASHA since I was a master’s student at UNC-Chapel\nHill, but I’m happy to be back this year and presenting some fun\nprojects I’ve worked on over the past few years.\nComputer\nAdaptive Naming Assessment for Aphasia: A New Tool for\nSLPs\nRobert Cavanaugh, Alexander M. Swiderski, Stacey Steel (also\npresenting!), William D. Hula, and Gerasimos Fergadiotis.\nIn this seminar we’ll give a very clinician-oriented primer on\nmeasurement and item-response theory (IRT), how we can use IRT to create\ncomputer adaptive tests, and how these tests can have greater clinical\nutility and reduce testing burden.\nThen we’ll review recent research using IRT to create an adaptive\nnaming test for individuals with aphasia and demo a new,\nFREE!!! web-application that implements a\ncomputer adaptive version of the Philadelphia Naming Test.\nIf you’re a clinician who works with individuals with aphasia, we\nhope that you’ll walk away with some new ideas about measurement and a\nnew assessment tool that is more informative and efficient.\nP.S. There’s a surprise bonus web-app at the end of this talk!\nTime: Friday 1:15pm\nLocation: CC/208-209\nDownload\nHandout\nNovel\nWeb Applications to Facilitate Discourse Analysis in Everyday Clinical\nPractice\nRobert Cavanaugh, Sarah Grace Dalton and Jessica\nRichardson.\nIn this 30-minute clinically-focused technical session, I’ll briefly\ngo over the Core Lexicon and Main Concept Analysis outcome measures for\nconnected speech in aphasia (and related disorders). Then I’ll demo\nanother new, FREE!!! web-app that is intended\nto make scoring Core Lexicon and Main Concept Analysis much easier and\nmore efficient. I’ll end on a few notes about the current clinical\nutility of this work.\nThis talk is intended to give SLPs another new tool in their toolbox\nand is the result of a very fun collaboration with Sarah Grace Dalton\n(Marquette University) and Jessica Richardson (University of New\nMexico).\nTime: Friday 8:30am\nLocation: CC/346\nDownload\nHandout\nBasic\nPsychological Need Satisfaction and Frustration in Aphasia: Correlations\nWith Aphasia Severity and Mood\nAbigail Smith, Camille Williams, Trish Hambridge, Tyson G.\nHarmon, Sarah E. Wallace, Tami Brancamp, Michael Biel, William Evans,\nand Robert Cavanaugh\nThis fantastic poster led by Abby Smith and Camille Williams at BYU\naimed to examine the relationship between aphasia severity and\nsatisfaction of basic psychological needs and Determine how mood relates\nto frustration of basic psychological needs.\nTime: Friday 11:00am\nLocation: CC/Hall B1 (and virtual)\nCognitive\nFunctions Supporting Learning Over Time in Naming Treatment for\nAphasia\nEmily Goldberg, William D. Hula, Robert Cavanaugh, Alexander\nSwiderski, Alyssa Autenwreith, and Michael Walsh Dickey\nIf you didn’t catch Emily’s stellar talk on how improvements unfold\novertime during SFA at this years Clinical Aphasiology Conference, you\nhave another opportunity to see it at ASHA. Emily used some fancy\nmixed-effects models to examine how 39 people improved during Semantic\nFeature Analysis treatment for aphasia. She also looked at whether\ncognitive processes like attention and visuospatial memory moderated the\nlearning curve during treatment.\nTime: Friday 4:30pm\nLocation: CC/342\n\n\n\n",
    "preview": "posts/2022-11-16-disseminating-free-web-apps-for-slps-at-asha2022/preview.png",
    "last_modified": "2023-09-11T20:39:23-04:00",
    "input_file": {},
    "preview_width": 960,
    "preview_height": 540
  },
  {
    "path": "posts/2022-06-25-aphasia-access-awareness-survey/",
    "title": "Visualizing the 2016, 2020, and 2022 Aphasia Awareness Surveys",
    "description": {},
    "author": [
      {
        "name": "Rob Cavanaugh",
        "url": {}
      }
    ],
    "date": "2022-06-27",
    "categories": [],
    "contents": "\nThe National Aphasia Association (NAA) recently released an update\nto their aphasia awareness survey, in response to the recent news of\nBruce Willis’ aphasia diagnosis.\n\nWe typically conduct this survey every four years but decided to\nalter the schedule in view of the recent media coverage of aphasia,\nfollowing the announcement by the Willis family.\n\nThe NAA’s post nicely shows the responses for 2022 and provides a\nnarrative description for how the responses changed in response to 2022.\nI thought it might be helpful to also visualize changes in survey\nresponses across the three survey years (2016, 2020, and 2022). The\nfollowing figures and tables attempt to show visually some of the\nnarrative comparisons from the NAA blog post.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe NAA used word clouds to show common responses to the question,\n“Where was the last place you recall reading or hearing about\naphasia?”\nFigure reprinted from https://www.aphasia.org/2022-aphasia-awareness-survey/To provide easy comparison, I calculate the most common words,\nbigrams (adjacent two-word combinations), and trigrams (adjacent\nthree-word combinations) by year. These tables can be searched,\nfiltered, or sorted by year, the number of mentions, and\nword/bigram/trigram.\n\n\nWords\n\n\n\nBigrams\n\n\n\nTrigrams\n\n\n\n\nThe survey also asked, “In your own words, how does aphasia affect\nthe afflicted person?”. To summarize the key words and phrases\nrespondents used to describe aphasia I also summarized the most frequent\nwords, bigrams and trigrams. Note that these are only for participants\nwho the NAA considered aphasia aware in that they reported they\nhad heard the term aphasia and could properly identify it as a language\ndisorder.\n\n\nWords\n\n\n\nBigrams\n\n\n\nTrigrams\n\n\n\n\nOverall, it does appear that awareness of aphasia improved after\nBruce Willis’ diagnosis of aphasia and could reasonably be attributed to\nthe publicity surrounding his diagnosis. It will be interesting to see\nwhether this increased awareness persists over time.\nHere’s the summary from the NAA:\n\nThis aphasia awareness numbers that we see in the 2022 survey are\nmuch higher than we saw in previous surveys, and more recently, in the\n2020 survey. More importantly, we’re seeing a higher percentage of\npeople that have heard of aphasia able to properly identify it as a\nlanguage disorder and understand that loss of language does not mean\nloss of intellect.\n\n\nAs more public figures are diagnosed with Aphasia, like Bruce Willis,\nEmilia Clarke, Gabby Giffords and so on, it’s important to help the\npublic better understand aphasia and know where they can get aphasia\nresources.\n\nR code for cleaning, combining and visualizing survey responses can\nbe found on github here: https://github.com/rbcavanaugh/personal-website-distill/tree/master/_posts/2022-06-25-aphasia-access-awareness-survey.\nThere is an R-script for cleaning the three survey documents. The code\nfor producing figures is in the .Rmd file.\nIf you have any suggestions for changes or additions, please don’t\nhesitate to reah out via email or twitter.\n\n\n\n",
    "preview": "posts/2022-06-25-aphasia-access-awareness-survey/preview.png",
    "last_modified": "2023-09-11T20:39:23-04:00",
    "input_file": {},
    "preview_width": 864,
    "preview_height": 576
  }
]
